/* eslint-disable no-irregular-whitespace */
import { Center, Heading, Text } from "@yamada-ui/react"

export const metadata = {
  title: "NotFound",
}

export default function NotFound() {
  const copipe = `男「妹が404エラー吐いてるんだけど」　妹「404 NOT FOUND」ｹﾞﾛｹﾞﾛ

1 ：以下、名無しにかわりましてVIPがお送りします：2013/11/11(月) 15:47:03.47 ID:jAgHYzwz0
幼馴染「あー…妹ちゃんファイル消しちゃったんじゃない？」
男「妹のファイル…？」
幼馴染「バックアップがあれば妹サーバーの妹ちゃんディレクトリにうｐすれば治ると思うけど…」
男「い、妹サーバー…？」
幼馴染「あれ？男君知らなかったの？」
男「な、何をさ？」
幼馴染「女の子はね、みんなサーバーなんだよ？」
男「う、うそだー」

4 ：以下、名無しにかわりましてVIPがお送りします：2013/11/11(月) 15:48:40.40 ID:RFwWHeJV0
続けろ！！！
続けなければお前の妹物エロ画像をすべて、近藤さんに転送するぞ！！

5 ：以下、名無しにかわりましてVIPがお送りします：2013/11/11(月) 15:48:55.48 ID:jAgHYzwz0
幼馴染「嘘じゃないよ、男君が今私にアクセスしたいなーって思うとするじゃん？」
男「アクセス…」
幼馴染「そしたら幼馴染サーバー内の私ディレクトリにうｐされてる内容で私が反応するのね」
男「ごめん全然わかんない」
幼馴染「保健の授業もしっかり受けないと…ダメだぞ☆」
男「保健でそんなこと習うっけ…」
幼馴染「まったく男君はいつもそーなんだからっ」
幼馴染「とりあえずサーバーに接続してみよっか」
男「う、うん」

7 ：以下、名無しにかわりましてVIPがお送りします：2013/11/11(月) 15:51:44.34 ID:jAgHYzwz0
幼馴染「えーっとIDとパスワードは？」
男「えっ…？」
幼馴染「いやいやいや…家族なら妹や姉のID、パスワードは知ってるでしょ！？」
男「…教えてもらったことない…」
幼馴染「あー男君って妹ちゃんからキモイとか言われてたもんね」
男「…うん」
幼馴染「うーん…IDはたぶん名前なんだよねー」
幼馴染「PWはデフォルトだと英数字の羅列だからなぁ…」
男「そんなぁ…」
幼馴染「妹ちゃんの部屋に何かヒントあるかもよ？」
男「うん、行ってみよう」

13 ：以下、名無しにかわりましてVIPがお送りします：2013/11/11(月) 15:57:23.83 ID:jAgHYzwz0
幼馴染「ほほー妹ちゃんの部屋可愛いじゃん」
男「お、俺も久しぶりに入った」ﾄﾞｷﾄﾞｷ
幼馴染「パジャマ発見」
男「あ、あんま変なことすんなよ」
幼馴染「ホントはｸﾝｶｸﾝｶしたいんじゃないのー？」ﾆﾔﾆﾔ
男「し、したいわけないだろっ///」
幼馴染「どーだかっ」ﾆﾔﾆﾔ
幼馴染「成長した妹ちゃんの良い匂いするかもだよー？」ﾆﾔﾆﾔ
男「う、うるさい！！ほらパスワード探すぞ！！」

14 ：以下、名無しにかわりましてVIPがお送りします：2013/11/11(月) 15:57:31.72 ID:CjedjoEC0
しえん

17 ：以下、名無しにかわりましてVIPがお送りします：2013/11/11(月) 16:01:04.62 ID:jAgHYzwz0
ｶﾞｻｺﾞｿ
男「うーん…雑誌に…マンガばっかだなこいつ…」
ｶﾞｻｺﾞｿ
幼馴染「そういえばさー」
男「んー？」
ｶﾞｻｺﾞｿ
幼馴染「なんであんなにキモイとか言われるほど嫌われたの？」
男「…わかるわけないだろ」
幼馴染「昔は仲良かったじゃん」
ｶﾞｻｺﾞｿ
男「うん」

32 ：以下、名無しにかわりましてVIPがお送りします：2013/11/11(月) 16:09:42.66 ID:jAgHYzwz0
ｶﾞｻｺﾞｿ
幼馴染「…ん？何か見つけたー」
男「おっ？パスワードか？」
幼馴染「いや、プリクラだねー」
男「…これだいぶ前に二人で撮ったやつだな」
幼馴染「へー…」ﾁﾗｯ
男「…なんだよ///」
幼馴染「へぇー…」ﾆﾔﾆﾔ
幼馴染「そこまで仲悪かったわけじゃないんじゃん」
男「どうだろ…この頃にはもうキモイとか言われてたけどな」

42 ：以下、名無しにかわりましてVIPがお送りします：2013/11/11(月) 16:16:41.93 ID:jAgHYzwz0
ｶﾞｻｺﾞｿ
幼馴染「まあ…女心っていうのは複雑だからね」
ｶﾞｻｺﾞｿ
男「そんなもんなのか」
幼馴染「おっ…何だろ」
ｶﾞｻｺﾞｿ
男「また何かあったのか？」
幼馴染「これ何かな…ぬいぐるみ？」
男「あー…修学旅行のお土産で買ってきたやつだ」
幼馴染「ほほー…ベッドの中にインしてあったよ」ﾆﾔﾆﾔ
幼馴染「抱いて寝てるんじゃないのっ」ﾆﾔﾆﾔ
男「ベ、ベッドは良いから別の場所を探せよ！！」

46 ：以下、名無しにかわりましてVIPがお送りします：2013/11/11(月) 16:21:19.53 ID:jAgHYzwz0
男「あっ…これは…さすがに見ちゃだめだな」
幼馴染「どれどれーっ」ﾋｮｲｯ
男「あっ」
幼馴染「ふふーん…手帳かー」
男「そ、それはダメだろー」
幼馴染「でもさ、パスワードとかメモってある可能性高いじゃん？」
男「うう…た、確かに」
幼馴染「いつまでもｹﾞﾛｹﾞﾛさせといて良いの？」
妹「404 NOT FOUND」ｹﾞﾛｹﾞﾛ
男「…しょうがない、見てみよう」

52 ：以下、名無しにかわりましてVIPがお送りします：2013/11/11(月) 16:30:16.34 ID:jAgHYzwz0
ﾍﾟﾗｯ
幼馴染「お兄ちゃんに好きな人ができたかもしれない！！」
男「ブハッ…」
幼馴染「…だって書いてあるんだもん」
男「マジかよ…」
幼馴染「女の人といるとこ見た、ムカつく」
男「ブハッ…」
幼馴染「…これは誰のことかな？」
男「ま、前に付き合って欲しいって言われてちょっとだけ付き合った子がいるんだよ」
幼馴染「ほうほう…続けて良い？」
男「か、関係ありそうなとこ探せよー？」

57 ：以下、名無しにかわりましてVIPがお送りします：2013/11/11(月) 16:38:00.51 ID:jAgHYzwz0
ﾍﾟﾗｯ
幼馴染「幼馴染さん勝手にお兄ちゃんの部屋入っていった…ムカつく」
男「ゲホッ…」
幼馴染「…ちょっとショック」
男「お前勝手に入って何してたのさ」
幼馴染「…ちょっと///」
幼馴染「そ、それより続けるよ」
男「あ、ああ…」
幼馴染「お兄ちゃん私のことなんてどうだって良いんだ！！」
男「ゲホゲホッ…」
幼馴染「…妹ちゃんって実はお兄ちゃんラブなんじゃないの？」

58 ：以下、名無しにかわりましてVIPがお送りします：2013/11/11(月) 16:42:01.53 ID:LC2Xk1uT0
しえん

59 ：以下、名無しにかわりましてVIPがお送りします：2013/11/11(月) 16:42:30.13 ID:jAgHYzwz0
ﾍﾟﾗｯ
幼馴染「ああまたお兄ちゃんにキモイとか言ってしまった…」
幼馴染「ばかばかっ…ああ…もう消えたい…」
男「…もしかして」
幼馴染「…うん、だから消したのね自分で」
幼馴染「本当は大好きなお兄ちゃんに素直になれなくて…」ﾆﾔﾆﾔ
男「に、ﾆﾔﾆﾔすんな」
ﾍﾟﾗｯ
幼馴染「あっ…あった、あったよパスワード」
男「ほんとか！？」
幼馴染「うん、それじゃ早速サーバーに接続してみよー」

64 ：以下、名無しにかわりましてVIPがお送りします：2013/11/11(月) 16:54:39.87 ID:jAgHYzwz0
男「どうやって接続すんのさ？」
幼馴染「こうだよーちゅー…」
妹「404 NOT FOUND」ｹﾞﾛｹﾞﾛ
ｻｻｯ
幼馴染「…よ、避けた…」
男「ああ…言い辛いんだけど…嫌われてたからなお前」
幼馴染「ズキッ…今のは効いたよ…」
幼馴染「はぁ…仕方ないね、男君がやって」
男「えっ…お、俺がっ！？」
幼馴染「だって妹ちゃんお兄ちゃんラブなんだもん」
妹「404 NOT FOUND…///」ｹﾞﾛｹﾞﾛ

67 ：以下、名無しにかわりましてVIPがお送りします：2013/11/11(月) 17:04:51.75 ID:jAgHYzwz0
男「うう…///」ﾄﾞｷﾄﾞｷ
幼馴染「ほら早く」
妹「404 NOT FOUND…///」ｹﾞﾛｹﾞﾛ
男「い、妹…///」ﾄﾞｷﾄﾞｷ
幼馴染「ああもうじれったい！！」ﾄﾞﾝｯ
男「あっ…」
妹「404 NOT FOU…んちゅっ///」
幼馴染「パスワードは…お兄ちゃん大好き」
男「ーーっ！！」
ﾋﾟﾛﾋﾟﾛﾋﾟﾛｶﾘｶﾘｶﾘ…
幼馴染「…うんうん、接続できそうだよ」

68 ：以下、名無しにかわりましてVIPがお送りします：2013/11/11(月) 17:09:59.11 ID:ffZTZ7tq0
素晴らしい

69 ：以下、名無しにかわりましてVIPがお送りします：2013/11/11(月) 17:16:03.05 ID:jAgHYzwz0
ーー　妹サーバー/妹/
男「…ここが妹サーバー」
幼馴染「そういうこと」
男「…何にもないな」
幼馴染「やっぱりファイル消しちゃったみたいだね」
男「ど、どうしたら良いんだよ」
幼馴染「どうも出来ないよねー」
男「えっ…ええー…」
幼馴染「だって何にも残って無…およ？」
妹「お兄ちゃん大好きっ！！お兄ちゃん大好きっ！！」
男「い、妹！？おい？どうした？」
幼馴染「あー…お兄ちゃん大好きファイルだけは消さなかったんだね」

72 ：以下、名無しにかわりましてVIPがお送りします：2013/11/11(月) 17:19:31.69 ID:RsfxJFpT0
妹と幼馴染が組んで男を騙してるのかと思ったらマジだった

78 ：以下、名無しにかわりましてVIPがお送りします：2013/11/11(月) 17:24:07.75 ID:jAgHYzwz0
妹「お兄ちゃんっ！！お兄ちゃん大好き！！」ﾁｭｯﾁｭｯ
男「や、やめろってっ///」
男「…だけど、このファイルがあるのに何で404エラーなんだ？」
幼馴染「はぁ…男君ってほんと馬鹿っ」
幼馴染「普通にアクセスしたらindex.妹ってファイルにアクセスするんだよー」
男「index.妹…」
幼馴染「これはお兄ちゃん大好き.妹だから」
男「そ、そんな…」
妹「お兄ちゃん大好きっ！！お兄ちゃん大好き！！」ﾁｭｯﾁｭｯ
幼馴染「…きっと男君ならこうやってこのファイル、見つけてくれるって思ったのかもね」
男「い、妹ぉ…」

82 ：以下、名無しにかわりましてVIPがお送りします：2013/11/11(月) 17:28:24.72 ID:zHZR5T1S0
なかなか面白い

85 ：以下、名無しにかわりましてVIPがお送りします：2013/11/11(月) 17:35:29.61 ID:jAgHYzwz0
幼馴染「…どうする？適当にindex.妹作ってアップしとく？」
男「そうしたらどうなんの？」
幼馴染「とりあえずエラーは出なくなる、でも…」
男「でも？」
幼馴染「今までの妹ちゃんではなくなるよね」
男「別人になっちゃうのか」
幼馴染「見た目は変わんないけどね」
男「…」
妹「お兄ちゃん大好きっ！！お兄ちゃん大好き！！」ﾁｭｯﾁｭｯ
幼馴染「…ま、このお兄ちゃん大好き.妹のファイル名を変更するって手もあるけど」
男「…つまり？」
幼馴染「すごいお兄ちゃん大好き妹ちゃんの完成」

88 ：以下、名無しにかわりましてVIPがお送りします：2013/11/11(月) 17:40:14.40 ID:VNdMq14E0
ゲロ吐いてる奴とちゅーしたのか？

90 ：以下、名無しにかわりましてVIPがお送りします：2013/11/11(月) 17:43:44.86 ID:S/i4WCx80
吐いてるのはエラー

91 ：以下、名無しにかわりましてVIPがお送りします：2013/11/11(月) 17:44:14.56 ID:jAgHYzwz0
幼馴染「…ま、少し考えてみて、私は別のディレクトリとか行けないか散歩してくるから」
男「お、おう」
妹「お兄ちゃんっ！！」ﾁｭｯﾁｭ
男「妹…なんで消しちゃったんだよ…」
妹「お兄ちゃんっ！！」ﾁｭｯﾁｭ
男「俺は…元のお前が良いよ…」
男「…」
ーーー
ーー
幼馴染「…いやー他のディレクトリにも行けてさー」
幼馴染「山田君の妹ちゃんあの顔でエロファイルばっかだったよ！！」ﾆﾔﾆﾔ
幼馴染「いやー人は見かけによらな…」
男「決めたよ…俺」

92 ：以下、名無しにかわりましてVIPがお送りします：2013/11/11(月) 17:49:27.46 ID:ffZTZ7tq0
山田君…？

95 ：以下、名無しにかわりましてVIPがお送りします：2013/11/11(月) 17:50:59.75 ID:tuc2q6hu0
あはははｗｗｗ妹のフォルダを漁るじょーｗｗｗ

96 ：以下、名無しにかわりましてVIPがお送りします：2013/11/11(月) 17:52:43.45 ID:GZGXfLWz0
>>95
ワロタｗｗｗｗｗｗｗ

97 ：以下、名無しにかわりましてVIPがお送りします：2013/11/11(月) 17:55:58.26 ID:jAgHYzwz0
男「お兄ちゃん大好き.妹をindex.妹に書き換えてくれ」
幼馴染「…いいのね？」
男「元はと言えば俺がこいつの気持ちに気付いてやれなかったからなんだ」
男「俺はこれから、こいつの気持ちに応え続けるよ」
幼馴染「…わかった、それじゃ書き換えるね」
ｽﾞﾙｽﾞﾙ
男「なっ///なんで妹を脱がすんだよ！？」
幼馴染「はぁー…無知は罪だよ、ファイル名はおまんこのとこに書いてあるに決まってるじゃん」
男「そ、そうだったのか…」
妹「お兄ちゃん大好きっ！！」ﾁｭｯﾁｭ
幼馴染「そいじゃやりますよ～」ｸﾁｭｸﾁｭ
妹「おっ…んっ…おにぃちゃぁんっ…はぁはぁ…だ、だいしゅきぃっ！！」

100 ：以下、名無しにかわりましてVIPがお送りします：2013/11/11(月) 18:04:32.56 ID:jAgHYzwz0
ーーー
ーー
幼馴染「…さて、私はもう帰るね」
男「おう…色々、ありがとな」
幼馴染「…いいよ、今度は妹ちゃんの気持ち…受け入れてあげてね」
男「おう」
幼馴染「はぁ…幼馴染って損な役だよね」
男「えっ…」
幼馴染「…ばいばい」
ﾊﾞﾀﾝ
男「…幼馴染」
妹「お兄ちゃんっ…続きしよぉ…///」ﾁｭｯﾁｭ
男「妹…ああ、そうだな…」ﾆｯｺﾘ

105 ：以下、名無しにかわりましてVIPがお送りします：2013/11/11(月) 18:14:41.56 ID:jAgHYzwz0
ー　翌日
ｶﾞﾊﾞｯ
妹「なっ…///な、な、な、なんなのよぉっ！？///」
男「ふぁぁ…あ、おはよ」ﾆｯｺﾘ
妹「おはよじゃないわよっ///な、なんでお兄ちゃんと一緒に寝てんのっ！？///」
男「なんでって…昨日俺達愛し合ったじゃないか///」
妹「う…嘘…」ｸﾁｭ…ﾄﾛｫ
妹「わわわっ…これって…///」
男「…どうした？もう一回する？///」
妹「なっ…///し、しないわよっ///何なのっ！？どうなってんの！？」ｵﾛｵﾛ
男「…？なんか変だぞ？」

106 ：以下、名無しにかわりましてVIPがお送りします：2013/11/11(月) 18:15:04.71 ID:d5+8q7OCO
妹「計画通り」ﾆﾔﾘ

107 ：以下、名無しにかわりましてVIPがお送りします：2013/11/11(月) 18:20:39.32 ID:jAgHYzwz0
ｶﾞﾁｬｯ
幼馴染「ごめーん、なんか昨日妹サーバーで障害あってファイル消えてたんだってー」
幼馴染「今朝完全に復旧したみたい…だ…よ」
男「えっ…」
妹「っ///」ﾌﾟﾙﾌﾟﾙ
幼馴染「…も、もしかして…もう気持ちに応えちゃった…？」
男「…」ｺｸﾝ
妹「…あ、あんたたちはぁー…一体…何したのよーっ///！！」
ｹﾞｼｹﾞｼｯ
男「ご、ごめんなしゃい…」
幼馴染「ごめんなしゃい…」
こうして、妹は元通り復旧されたが
責任を取って男は妹と付き合うことになった
早まった行動をする前に問い合わせフォームを活用しよう！
～　おわり　～`

  return (
    <>
      <Heading
        color="blackAlpha.300"
        fontSize="9xl"
        sx={{
          left: "50%",
          position: "fixed",
          top: "50%",
          transform: "translate(-50%, -50%)",
        }}
        variant="h1"
        zIndex={-1}
      >
        404: Not Found
      </Heading>
      <Center>
        <Text variant="body1" whiteSpace="pre-line">
          {copipe}
        </Text>
      </Center>
    </>
  )
}
